packages/windmapper/windmapper-2.1.14-cp38-cp38-macosx_13_0_x86_64.whl/windmapper-2.1.14.data/data/share/windninja/ninjafoam/2.2.0/system/controlDict_moveDynamicMesh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     moveDynamicMesh; //simpleFoam, turbFoam, vmsFoam, etc;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         50;

deltaT          1.0;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

// ************************************************************************* //
